index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-05 Wed 19:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Operating Cash Flow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Operating Cash Flow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org78bb087">1. Introduction</a></li>
<li><a href="#orgdb73ddc">2. Why Not Profit?</a></li>
<li><a href="#orgfbc45d2">3. Finance Cash Flow \(\neq\) Accounting Cash Flow</a></li>
<li><a href="#orgf2def0c">4. Definitions of "Cash Flow"</a></li>
<li><a href="#org73f936f">5. A Common Definition</a></li>
<li><a href="#orgdf9e401">6. OCF</a></li>
<li><a href="#orgff6e249">7. Interactive App</a></li>
<li><a href="#org9a897a2">8. Credits and Collaboration</a></li>
</ul>
</div>
</div>


<div id="outline-container-org78bb087" class="outline-2">
<h2 id="org78bb087"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The value of any financial asset is the the sum of <b>expected cash flows</b> from that asset discounted at a risk-adjusted rate.  Thus the first step in valuing any asset is determining the expected cash flows that the asset will generate.
</p>

<ul class="org-ul">
<li>We pay stock and bond holders in cash, and not with measures such as 'profit'.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdb73ddc" class="outline-2">
<h2 id="orgdb73ddc"><span class="section-number-2">2</span> Why Not Profit?</h2>
<div class="outline-text-2" id="text-2">
<p>
Non-cash deductions, such as Depreciation and Amortization, are made when calculating profit.
</p>

<ul class="org-ul">
<li>While these deductions lower profit, they do not actually lower cash held by the firm, which can be used to pay asset holders.</li>
</ul>

<p>
Also, cash payments for certain items are not deducted when they are made, but depreciated over time.  
</p>

<ul class="org-ul">
<li>This means at times profit may be higher than the available cash for investors.</li>
</ul>
</div>
</div>



<div id="outline-container-orgfbc45d2" class="outline-2">
<h2 id="orgfbc45d2"><span class="section-number-2">3</span> Finance Cash Flow \(\neq\) Accounting Cash Flow</h2>
<div class="outline-text-2" id="text-3">
<p>
The term 'Cash Flow' in finance is different from the accounting 'Statement of Cash Flows'.   
</p>

<p>
Also in finance, we usually are most interested in cash flow from operating the business, and <b>not</b> cash flows from financing activities.
</p>

<ul class="org-ul">
<li>If you are going to buy a company, you are free to change how the assets are financed.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf2def0c" class="outline-2">
<h2 id="orgf2def0c"><span class="section-number-2">4</span> Definitions of "Cash Flow"</h2>
<div class="outline-text-2" id="text-4">
<p>
There are various measures of cash flow, such as Operating Cash Flow and Free Cash Flow.
</p>

<ul class="org-ul">
<li>Also, there can be particular ways to calculate cash flows for unique industries (such as movie production companies).</li>
<li>Some may even define "Free Cash Flow" in different ways.</li>
</ul>

<p>
The key, however, is that we are trying to estimate the amount of cash we can regularly return to investors.
</p>
</div>
</div>



<div id="outline-container-org73f936f" class="outline-2">
<h2 id="org73f936f"><span class="section-number-2">5</span> A Common Definition</h2>
<div class="outline-text-2" id="text-5">
<p>
A very common definition is Operating Cash Flow (OCF).  
</p>

<ul class="org-ul">
<li>This is cash flow from operating your firm's assets, and excludes cash flows from financing activities.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdf9e401" class="outline-2">
<h2 id="orgdf9e401"><span class="section-number-2">6</span> OCF</h2>
<div class="outline-text-2" id="text-6">
<p>
OCF is calculated as earnings before interest and taxes (EBIT) plus Depreciation (D) minus Taxes (T).
</p>

<ul class="org-ul">
<li>\(OCF = EBIT + D - T\)</li>

<li>Note, that we don't deduct interest expense even though it is a cash charge.  This is because interest expense is not an operating charge, but rather determined by how we chose to finance our assets.</li>
</ul>
</div>
</div>




<div id="outline-container-orgff6e249" class="outline-2">
<h2 id="orgff6e249"><span class="section-number-2">7</span> Interactive App</h2>
<div class="outline-text-2" id="text-7">
<p>
The following app will calculate OCF for any company you choose.  
</p>

<ul class="org-ul">
<li>Note how different OCF can be from Net Income.</li>
</ul>



  <style>
   .slidecontainer {
  width: 100%; /* Width of the outside container */
}

/* The slider itself */
.slider {
  -webkit-appearance: none;  /* Override default CSS styles */
  appearance: none;
  width: 100%; /* Full-width */
  height: 25px; /* Specified height */
  background: #d3d3d3; /* Grey background */
  outline: none; /* Remove outline */
  opacity: 0.7; /* Set transparency (for mouse-over effects on hover) */
  -webkit-transition: .2s; /* 0.2 seconds transition on hover */
  transition: opacity .2s;
}

/* Mouse-over effects */
.slider:hover {
  opacity: 1; /* Fully shown on mouse-over */
}

/* The slider handle (use -webkit- (Chrome, Opera, Safari, Edge) and -moz- (Firefox) to override default look) */
.slider::-webkit-slider-thumb {
  -webkit-appearance: none; /* Override default look */
  appearance: none;
  width: 25px; /* Set a specific slider handle width */
  height: 25px; /* Slider handle height */
  background: #4CAF50; /* Green background */
  cursor: pointer; /* Cursor on hover */
}

.slider::-moz-range-thumb {
  width: 25px; /* Set a specific slider handle width */
  height: 25px; /* Slider handle height */
  background: #4CAF50; /* Green background */
  cursor: pointer; /* Cursor on hover */
} 

table {
  font-family: arial, sans-serif;
  border-collapse: collapse;
  width: 100%;
}

td, th {
  border: 1px solid #dddddd;
  text-align: left;
  padding: 8px;
}

tr:nth-child(even) {
  background-color: #dddddd;
}
  </style>



  <center><h2>OCF Calculator:</h2></center>
<div class="slidecontainer">
  <input type="range" min="0" max="100" value="50" class="slider" id="sales">
  <p align="center"><b>Sales: <span id="sales_out"></b></span></p>  
  <input type="range" min="0" max="100" value="50" class="slider" id="costs">
  <p align="center"><b>Costs: <span id="costs_out"></b></span></p>  
  <input type="range" min="0" max="100" value="50" class="slider" id="depreciation">
  <p align="center"><b>Depreciation: <span id="depreciation_out"></b></span></p>  
  <input type="range" min="0" max="100" value="40" class="slider" id="tax_rate">
  <p align="center"><b>Tax Rate: <span id="tax_rate_out">%</b></span></p>  
</div>

<center><button onclick="myJsFunction()">Calculate</button></center>
<center>
<br>
<table>
  <tr>
    <th>Sales</th>
    <th><span id="sales_table"></span></th>
  </tr>
  <tr>
    <th>Costs</th>
    <th><span id="costs_table"></span></th>
  </tr>
  <tr>
    <th>Depreciation</th>
    <th><span id="depreciation_table"></span></th>
  </tr>
  <tr>
    <th>EBIT</th>
    <th><span id="ebit"></span></th>
  </tr>
  <tr>
    <th>Taxes</th>
    <th><span id="taxes"></span></th>
  </tr>
  <tr>
    <th>OCF</th>
    <th><span id="ocf"></span></th>
  </tr>
</table>
</center>

    <script src="src/app1.js"></script>
</div>
</div>




<div id="outline-container-org9a897a2" class="outline-2">
<h2 id="org9a897a2"><span class="section-number-2">8</span> Credits and Collaboration</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://github.com/financial-education/operating_cash_flow">The code is here and pull requests are welcome.</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2020-02-05 Wed 19:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
